# Contents
 - \# DataFrame Examples
 - \# DataFrame 만들기
 - \# DataFrame Handling
 - \# DataFrame Reading & Writing

# # DataFrame Examples

In [1]:
# setting
import seaborn as sns
df_iris = sns.load_dataset('iris')
df_titanic = sns.load_dataset('titanic')
df_tips = sns.load_dataset('tips')

### [DataFrame] iris

In [2]:
# 하나의 행: 하나의 iris(붓꽃) 개체에 대한 정보 >> [Observation-Level]
display(df_iris.shape, df_iris.head(3))

(150, 5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [3]:
df_iris.index   # 0~149

RangeIndex(start=0, stop=150, step=1)

In [4]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

### [DataFrame] titanic

In [5]:
# 하나의 행: 타이타닉호 승객 한 명에 대한 정보 >> (Passenger-Level)
display(df_titanic.shape, df_titanic.head(3))

(891, 15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [6]:
df_titanic.index

RangeIndex(start=0, stop=891, step=1)

In [7]:
df_titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

### [DataFrame] tips

In [8]:
# 하나의 행: payment transaction 한 건에 대한 정보 >> [Payment_Transaction-Level]
display(df_tips.shape, df_tips.head(3))

(244, 7)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [9]:
df_tips.index

RangeIndex(start=0, stop=244, step=1)

In [10]:
df_tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

# # DataFrame 만들기

In [11]:
import pandas as pd

### 1. list

In [12]:
li_student_id = ['A0231118U', 'A03412341U', 'A0324322U', 'A0123123U']
li_english = [80, 90, 95, 88]
li_math = [75, 99, 80, 98]
li_history = [88, 87, 75, 77]
li_datascience = [50, 60, 99, 75]

pd.DataFrame({'student_id': li_student_id, 
              'english': li_english,
              'math': li_math,
              'history': li_history,
              'datascience': li_datascience})

   student_id  english  math  history  datascience
0   A0231118U       80    75       88           50
1  A03412341U       90    99       87           60
2   A0324322U       95    80       75           99
3   A0123123U       88    98       77           75

### 2. series

In [13]:
s_student_id = pd.Series(['A0231118U', 'A03412341U', 'A0324322U', 'A0123123U'])
s_english = pd.Series([80, 90, 95, 88])
s_math = pd.Series([75, 99, 80, 93])
s_history = pd.Series([88, 87, 75, 77])
s_datascience = pd.Series([50, 60, 99, 75])

pd.DataFrame({'student_id': s_student_id,
              'english': s_english,
              'math': s_math, 
              'history': s_history,
              'datascience': s_datascience})

   student_id  english  math  history  datascience
0   A0231118U       80    75       88           50
1  A03412341U       90    99       87           60
2   A0324322U       95    80       75           99
3   A0123123U       88    93       77           75

### 3. numpy array

In [14]:
import numpy as np

In [15]:
pd.DataFrame(np.arange(12).reshape(3,4),
             index = ['row1', 'row2', 'row3'],
             columns = ['a', 'b', 'c', 'd'])

      a  b   c   d
row1  0  1   2   3
row2  4  5   6   7
row3  8  9  10  11

# # DataFrame Handling

In [16]:
import pandas as pd

s_student_id = pd.Series(['A0231118U', 'A03412341U', 'A0324322U', 'A0123123U'])
s_english = pd.Series([80, 90, 95, 88])
s_math = pd.Series([75, 99, 80, 93])

df = pd.DataFrame({'student_id': s_student_id,
                   'english': s_english,
                   'math': s_math
})

df

   student_id  english  math
0   A0231118U       80    75
1  A03412341U       90    99
2   A0324322U       95    80
3   A0123123U       88    93

### 1.

In [17]:
df['history'] = pd.Series([55, 60, 77, 99])
df

   student_id  english  math  history
0   A0231118U       80    75       55
1  A03412341U       90    99       60
2   A0324322U       95    80       77
3   A0123123U       88    93       99

### 2.

In [18]:
df['total'] = df['english'] + df['math'] + df['history']
df

   student_id  english  math  history  total
0   A0231118U       80    75       55    210
1  A03412341U       90    99       60    249
2   A0324322U       95    80       77    252
3   A0123123U       88    93       99    280

### DF column names
 - DF column 이름 바꾸기: 소문자로
   - df= df.rename(columns=str.lower)
 - DF column 이름 바꾸기: 소문자 & 스페이스>언더바 대체
   - df.columns = map(lambda x: x.lower().replace(' ','_'), df.columns)

# # DataFrame Reading & Writing

In [19]:
# setting
import pandas as pd
df = pd.DataFrame({'student_id': ['A023U', 'A034U', 'A022U', 'A012U'],
                   'english': [80, 90, 95, 88],
                   'math': [75, 99, 80, 93]})
df

  student_id  english  math
0      A023U       80    75
1      A034U       90    99
2      A022U       95    80
3      A012U       88    93

### 1. csv

In [20]:
df.to_csv('./test_csv_data.csv')

In [21]:
pd.read_csv('./test_csv_data.csv')

   Unnamed: 0 student_id  english  math
0           0      A023U       80    75
1           1      A034U       90    99
2           2      A022U       95    80
3           3      A012U       88    93

In [22]:
df.to_csv('./test_csv_data.csv', index = False)

In [23]:
pd.read_csv('./test_csv_data.csv')

  student_id  english  math
0      A023U       80    75
1      A034U       90    99
2      A022U       95    80
3      A012U       88    93

### 2. Excel

In [24]:
df.to_excel('./test_csv_data.xlsx', sheet_name='1pg', index=False)

In [25]:
pd.read_excel('./test_csv_data.xlsx')

  student_id  english  math
0      A023U       80    75
1      A034U       90    99
2      A022U       95    80
3      A012U       88    93

In [26]:
pd.read_excel('./test_csv_data.xlsx', sheet_name='1pg')

  student_id  english  math
0      A023U       80    75
1      A034U       90    99
2      A022U       95    80
3      A012U       88    93

### +a) Excel - Multiple Sheets

In [27]:
df

  student_id  english  math
0      A023U       80    75
1      A034U       90    99
2      A022U       95    80
3      A012U       88    93

In [28]:
df2 = df.copy(); df2['history'] = pd.Series([70, 55, 65]); 
df2

  student_id  english  math  history
0      A023U       80    75     70.0
1      A034U       90    99     55.0
2      A022U       95    80     65.0
3      A012U       88    93      NaN

In [29]:
with pd.ExcelWriter('multiple_sheets.xlsx') as writer:
    df.to_excel(writer, sheet_name='1pg', index=False)
    df2.to_excel(writer, sheet_name='2pg', index=False)

In [30]:
pd.read_excel('./multiple_sheets.xlsx', sheet_name='1pg')

  student_id  english  math
0      A023U       80    75
1      A034U       90    99
2      A022U       95    80
3      A012U       88    93

In [31]:
pd.read_excel('./multiple_sheets.xlsx', sheet_name='2pg')

  student_id  english  math  history
0      A023U       80    75     70.0
1      A034U       90    99     55.0
2      A022U       95    80     65.0
3      A012U       88    93      NaN